Dlubal.RFEM5.Surface
Basic surface parameters

Dlubal.RFEM5.Surface.No
Number

Dlubal.RFEM5.Surface.ID
Identifier

Dlubal.RFEM5.Surface.Comment
Comment

Dlubal.RFEM5.Surface.Tag
Tag

Dlubal.RFEM5.Surface.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.Surface.IsGenerated
Information if the object is generated or not (read only)

Dlubal.RFEM5.Surface.GeometryType
Type of the surface geometry

Dlubal.RFEM5.Surface.StiffnessType
Type of the surface stiffness

Dlubal.RFEM5.Surface.MaterialNo
Material number

Dlubal.RFEM5.Surface.BoundaryLineCount
Count of boundary lines (read only)

Dlubal.RFEM5.Surface.BoundaryLineList
List of boundary lines

Dlubal.RFEM5.Surface.Thickness
Thickness

Dlubal.RFEM5.Surface.Eccentricity
Eccentricity ez

Dlubal.RFEM5.Surface.Area
Area of the surface (read only)

Dlubal.RFEM5.Surface.SetIntegratedObjects
Enables to set integrated surface objects.

Dlubal.RFEM5.Surface.IntegratedNodeCount
Count of integrated nodes (read only)

Dlubal.RFEM5.Surface.IntegratedNodeList
List of integrated nodes

Dlubal.RFEM5.Surface.IntegratedLineCount
Count of integrated lines (read only)

Dlubal.RFEM5.Surface.IntegratedLineList
List of integrated lines

Dlubal.RFEM5.Surface.IntegratedOpeningCount
Count of integrated openings (read only)

Dlubal.RFEM5.Surface.IntegratedOpeningList
List of integrated openings

Dlubal.RFEM5.Surface.ControlPoints
Control points of the surface (read only)